export const solvedData = {
  test: {
    // 2020: {
    //   9: ["1 : 23 : 31", "85점", "2등급"],
    //   8: ["1 : 23 : 31", "85점", "2등급"],
    //   7: ["1 : 23 : 31", "85점", "2등급"],
    //   6: ["1 : 23 : 31", "85점", "2등급"],
    // },
    // 2018: {
    //   11: ["1 : 23 : 31", "85점", "2등급"],
    //   10: ["1 : 23 : 31", "85점", "2등급"],
    //   // 9: ["1 : 23 : 31", "85점", "2등급"],
    //   // 8: ["1 : 23 : 31", "85점", "2등급"],
    //   // 7: ["1 : 23 : 31", "85점", "2등급"],
    //   6: ["1 : 23 : 31", "85점", "2등급"],
    //   5: ["1 : 23 : 31", "85점", "2등급"],
    //   4: ["1 : 23 : 31", "85점", "2등급"],
    //   3: ["1 : 23 : 31", "85점", "2등급"],
    // },
  },
  recommend: {
    2010: {
      1: ["0:23:31", "4/5 문제"],
      2: ["0:20:33", "3/5 문제"],
      3: ["0:18:21", "5/5 문제"],
      4: ["0:24:41", "2/5 문제"],
      5: ["0:21:22", "4/5 문제"],
      6: ["0:19:34", "5/5 문제"],
      7: ["0:23:31", "4/5 문제"],
      8: ["0:20:33", "3/5 문제"],
      9: ["0:18:21", "5/5 문제"],
      10: ["0:24:41", "2/5 문제"],
      11: ["0:21:22", "4/5 문제"],
      12: ["0:19:34", "5/5 문제"],
      13: ["0:23:31", "4/5 문제"],
      14: ["0:20:33", "3/5 문제"],
      15: ["0:18:21", "5/5 문제"],
      16: ["0:24:41", "2/5 문제"],
      17: ["0:21:22", "4/5 문제"],
      18: ["0:19:34", "5/5 문제"],
      19: ["0:23:31", "4/5 문제"],
      10: ["0:20:33", "3/5 문제"],
      21: ["0:18:21", "5/5 문제"],
      22: ["0:24:41", "2/5 문제"],
      23: ["0:21:22", "4/5 문제"],
      24: ["0:19:34", "5/5 문제"],
      25: ["0:23:31", "4/5 문제"],
      26: ["0:20:33", "3/5 문제"],
      27: ["0:18:21", "5/5 문제"],
      28: ["0:24:41", "2/5 문제"],
      29: ["0:21:22", "4/5 문제"],
      30: ["0:19:34", "5/5 문제"],
    },
    2009: {
      20: ["0:23:31", "4/5 문제"],
      21: ["0:20:33", "3/5 문제"],
      22: ["0:18:21", "5/5 문제"],
      23: ["0:24:41", "2/5 문제"],
      24: ["0:21:22", "4/5 문제"],
      25: ["0:19:34", "5/5 문제"],
    },
    2008: {
      20: ["0:23:31", "4/5 문제"],
      21: ["0:20:33", "3/5 문제"],
      22: ["0:18:21", "5/5 문제"],
      23: ["0:24:41", "2/5 문제"],
      24: ["0:21:22", "4/5 문제"],
      25: ["0:19:34", "5/5 문제"],
    },
    2007: {
      20: ["0:23:31", "4/5 문제"],
      21: ["0:20:33", "3/5 문제"],
      22: ["0:18:21", "5/5 문제"],
      23: ["0:24:41", "2/5 문제"],
      24: ["0:21:22", "4/5 문제"],
      25: ["0:19:34", "5/5 문제"],
    },
    2006: {
      20: ["0:23:31", "4/5 문제"],
      21: ["0:20:33", "3/5 문제"],
      22: ["0:18:21", "5/5 문제"],
      23: ["0:24:41", "2/5 문제"],
      24: ["0:21:22", "4/5 문제"],
      25: ["0:19:34", "5/5 문제"],
    },
    2005: {
      20: ["0:23:31", "4/5 문제"],
      21: ["0:20:33", "3/5 문제"],
      22: ["0:18:21", "5/5 문제"],
      23: ["0:24:41", "2/5 문제"],
      24: ["0:21:22", "4/5 문제"],
      25: ["0:19:34", "5/5 문제"],
    },
    2004: {
      20: ["0:23:31", "4/5 문제"],
      21: ["0:20:33", "3/5 문제"],
      22: ["0:18:21", "5/5 문제"],
      23: ["0:24:41", "2/5 문제"],
      24: ["0:21:22", "4/5 문제"],
      25: ["0:19:34", "5/5 문제"],
    },
    2003: {
      20: ["0:23:31", "4/5 문제"],
      21: ["0:20:33", "3/5 문제"],
      22: ["0:18:21", "5/5 문제"],
      23: ["0:24:41", "2/5 문제"],
      24: ["0:21:22", "4/5 문제"],
      25: ["0:19:34", "5/5 문제"],
    },
    2002: {
      20: ["0:23:31", "4/5 문제"],
      21: ["0:20:33", "3/5 문제"],
      22: ["0:18:21", "5/5 문제"],
      23: ["0:24:41", "2/5 문제"],
      24: ["0:21:22", "4/5 문제"],
      25: ["0:19:34", "5/5 문제"],
    },
  },
};

export const studentSolveData = {
  test: {
    studentAns: {
      1: 1,
      2: 2,
      3: 3,
      4: 3,
      5: 4,
      6: 5,
      7: 1,
      8: 3,
      9: 2,
      10: 5,
      11: 2,
      12: 3,
      13: 5,
      14: 1,
      15: 2,
      16: 2,
      17: 5,
      18: 3,
      19: 2,
      20: 1,
      21: 27,
      22: 84,
      23: 10,
      24: 632,
      25: 71,
      26: 59,
      27: 81,
      28: 75,
      29: 11,
      30: 19,
    },
  },
  recommend: {
    studentAns: {
      1: 2,
      2: 1,
      3: 5,
    },
    time: {
      1: 215,
      2: 201,
      3: 103,
    },
  },
};

export const getSolvedMonth = (year, month) => {
  return solvedData.test[year]?.[month];
};

export const setSolvedData = (year, month, time, grade, rank) => {
  if (!solvedData.test[year]) solvedData.test[year] = {};
  solvedData.test[year][month] = [time, grade, rank];
};

export const resetSolvedData = () => {
  solvedData.test = {};
};

export const getTodayDateKey = () => {
  const date = new Date();
  const [year, month, day] = [
    date.getFullYear() % 100,
    date.getMonth() + 1,
    date.getDate(),
  ];
  return [`${year}${month}`, `${day}`];
};

export const setRecommendData = (
  time,
  result,
  monthKey = undefined,
  dayKey = undefined
) => {
  if (!monthKey && !dayKey) [monthKey, dayKey] = getTodayDateKey();
  if (!solvedData.recommend[monthKey]) solvedData.recommend[monthKey] = {};
  solvedData.recommend[monthKey][dayKey] = [time, result];
  // solvedData.recommend[monthKey] = {
  //   ...solvedData.recommend[monthKey],
  //   [dayKey]: [time, result],
};

export const getRecommendData = (monthKey = undefined, dayKey = undefined) => {
  if (!monthKey && !dayKey) [monthKey, dayKey] = getTodayDateKey();
  return solvedData.recommend[monthKey]?.[dayKey];
};

export const getRecommendStudentData = (
  monthKey = undefined,
  dayKey = undefined
) => {
  if (!monthKey && !dayKey) [monthKey, dayKey] = getTodayDateKey();
  return studentSolveData.recommend;
};

export const getRecommendContinuity = () => {
  let date = new Date();
  let retval = 1;
  while (true) {
    date.setDate(date.getDate() - 1);
    let [y, m, d] = [
      date.getFullYear() % 100,
      date.getMonth() + 1,
      date.getDate(),
    ];
    if (solvedData.recommend[`${y}${m}`]?.[`${d}`]) {
      retval += 1;
    } else return retval;
  }
};
